wosayttn/M55M1BSP/_CUnit/lpuart/lpuart_cunit.c
/*---------------------------------------------------------------------------------------------------------*/
/* Nuvoton Technology Corporation confidential                                                            */
/*                                                                                                         */
/* Copyright (C) 2020 Nuvoton Technology Corp.                                                             */
/* All rights reserved                                                                                     */
/*                                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/
/* File Contents:                                                                                          */
/*   LPUART_cunit_test.c                                                                                    */
/*            The test function of VIC for CUnit.                                                         */
/* Project:   M253                                                                                       */
/*---------------------------------------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------------------------------------*/
/* Includes of system headers                                                                              */
/*---------------------------------------------------------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include <assert.h>
#include "NuMicro.h"

/*---------------------------------------------------------------------------------------------------------*/
/* Includes of local headers                                                                               */
/*---------------------------------------------------------------------------------------------------------*/
#include "CUnit.h"
#include "Console.h"
#include "lpuart_cunit.h"



#define LPUART_CH_NUM_MAX 1

extern unsigned int STATE0;
extern unsigned int STATE1;
extern unsigned int ERR_STATE0;
extern unsigned int ERR_STATE1;
/*---------------------------------------------------------------------------------------------------------*/
/* Test function                                                                                           */
/*---------------------------------------------------------------------------------------------------------*/

int suite_success_init(void)
{
    return 0;
}
int suite_success_clean(void)
{
    return 0;
}



/*---------------------------------------------------------------------------------------------------------*/
/* Function: function_name                                                                                 */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               param - [in/out], parameter_description                                                   */
/*               param - [in/out], parameter_description                                                   */
/*                                                                                                         */
/* Returns:      the_value                                                                                 */
/* Side effects: the_effect                                                                                */
/* Description:                                                                                            */
/*               description                                                                               */
/*---------------------------------------------------------------------------------------------------------*/

CU_SuiteInfo LPUART_suites[] =
{
    {"LPUART API", suite_success_init, suite_success_clean, NULL, NULL, LPUART_ApiTests},
    {"LPUART MACRO", suite_success_init, suite_success_clean, NULL, NULL, LPUART_MacroTests},
    CU_SUITE_INFO_NULL
};



//LPUART_T *LpUartCh[10] =
//{
//    LPUART0,  //skip debug port UART0 test
//};

void LPUART_IPReset(LPUART_T *psLPUART)
{
    /* Unlock protected registers */
    SYS_UnlockReg(); 
    switch ((uint32_t)psLPUART)
    {
        case (uint32_t)LPUART0:
             SYS_ResetModule(SYS_LPUART0RST);  // Reset UART0 IP
            break;

    }
    /* Lock protected registers */
    SYS_LockReg();
}

void TestFunc_LPUART_EnableFlowCtrl()
{
    uint8_t u8LpUartChIdx;    //UART channel index

    /* UART 4 is  not support the Auto Flow Control*/
//    for (u8LpUartChIdx = 0; u8LpUartChIdx < LPUART_CH_NUM_MAX ; u8LpUartChIdx++)
    {
        LPUART_EnableFlowCtrl(LPUART0);
        CU_ASSERT((LPUART0->INTEN & (LPUART_INTEN_ATORTSEN_Msk | LPUART_INTEN_ATOCTSEN_Msk))
                  == (LPUART_INTEN_ATORTSEN_Msk | LPUART_INTEN_ATOCTSEN_Msk));
        CU_ASSERT((LPUART0->MODEM & LPUART_MODEM_RTSACTLV_Msk) == LPUART_MODEM_RTSACTLV_Msk);
        CU_ASSERT((LPUART0->MODEMSTS & LPUART_MODEMSTS_CTSACTLV_Msk) == LPUART_MODEMSTS_CTSACTLV_Msk);
        LPUART_DisableFlowCtrl(LPUART0);
        CU_ASSERT((LPUART0->INTEN & (LPUART_INTEN_ATORTSEN_Msk | LPUART_INTEN_ATOCTSEN_Msk)) == 0);
    }
}

const uint32_t au32LpUartINTEnSel[10] =
{
    LPUART_INTEN_RDAIEN_Msk,       //0 : Receive data available interrupt
    LPUART_INTEN_THREIEN_Msk,      //1 : Transmit holding register empty interrupt
    LPUART_INTEN_RLSIEN_Msk,       //2 : Receive line status interrupt
    LPUART_INTEN_MODEMIEN_Msk,     //3 : Modem status interrupt
    LPUART_INTEN_RXTOIEN_Msk,      //4 : Rx time-out interrupt
    LPUART_INTEN_BUFERRIEN_Msk,    //5 : Buffer error interrupt
    LPUART_INTEN_WKIEN_Msk,        //6 : Wake-up interrupt
    LPUART_INTEN_TOCNTEN_Msk,      //7 : Time-out interrupt
    LPUART_INTEN_ABRIEN_Msk,       //8 : Auto baud-rate interrupt
    LPUART_INTEN_TXENDIEN_Msk,     //9 : Tx end interrupt
};

void TestFunc_LPUART_EnableInt()
{
    uint8_t u8LpUartChIdx;    //UART channel index
    uint8_t u8LpUartINTEnIdx; //bit

