wosayttn/M55M1BSP/_CUnit/lpuart/lpuart_cunit.c
    /* test loop */
//    for (u8LpUartChIdx = 0; u8LpUartChIdx < LPUART_CH_NUM_MAX; u8LpLpUartChIdx++)
    {
        //enable interrupt
        for (u8LpUartINTEnIdx = 0; u8LpUartINTEnIdx < 10; u8LpUartINTEnIdx++)
        {
            //skip THRE interrupt
            if (u8LpUartINTEnIdx == 1 ) continue;

            LPUART_EnableInt(LPUART0, au32LpUartINTEnSel[u8LpUartINTEnIdx]);
            CU_ASSERT((LPUART0->INTEN & au32LpUartINTEnSel[u8LpUartINTEnIdx]) == au32LpUartINTEnSel[u8LpUartINTEnIdx]);
        }

        //disable interrupt
        for (u8LpUartINTEnIdx = 0; u8LpUartINTEnIdx < 10; u8LpUartINTEnIdx++)
        {
            LPUART_DisableInt(LPUART0, au32LpUartINTEnSel[u8LpUartINTEnIdx]);
            CU_ASSERT((LPUART0->INTEN & au32LpUartINTEnSel[u8LpUartINTEnIdx]) == 0);
        }

        //enable interrupt
        for (u8LpUartINTEnIdx = 0; u8LpUartINTEnIdx < 10; u8LpUartINTEnIdx++)
        {
            //skip THRE interrupt
            if (u8LpUartINTEnIdx == 1) continue;

            LPUART_EnableInt(LPUART0, au32LpUartINTEnSel[u8LpUartINTEnIdx]);
            LPUART_Close(LPUART0);
            CU_ASSERT((LPUART0->INTEN) == 0);
        }

    }

//    NVIC_DisableIRQ(LPUART0_IRQn);

}

void SetLPUARTClockSource(LPUART_T* lpuart, uint32_t u32Source, uint32_t u32Div)
{
    /* Unlock protected registers */
    SYS_UnlockReg(); 
	  if (lpuart == LPUART0)
    {
        /* Set UART clock source selection */
        CLK->LPUARTSEL = (CLK->LPUARTSEL & ~ CLK_LPUARTSEL_LPUART0SEL_Msk) | (u32Source << CLK_LPUARTSEL_LPUART0SEL_Pos);
        /* Set UART clock divider number */
        CLK->LPUARTDIV = (CLK->LPUARTDIV & ~ CLK_LPUARTDIV_LPUART0DIV_Msk) | (u32Div << CLK_LPUARTDIV_LPUART0DIV_Pos);
    }
    /* Lock protected registers */
    SYS_LockReg();
}



uint32_t GetLpUartBaudrate(LPUART_T* lpuart)
{
    uint32_t u32LpUartClkSrcSel = 0, u32LpUartClkDivNum = 0;
    uint32_t au32ClkTbl[4] = {0,__LXT, __MIRC, __HIRC};
    uint32_t u32Baud_Div;

    if(lpuart==(LPUART_T*)LPUART0)
    {
        /* Get LPUART clock source selection */
        u32LpUartClkSrcSel = ((CLK->LPUARTSEL & CLK_LPUARTSEL_LPUART0SEL_Msk)) >> CLK_LPUARTSEL_LPUART0SEL_Pos;
        /* Get LPUART clock divider number */
        u32LpUartClkDivNum = (CLK->LPUARTDIV & CLK_LPUARTDIV_LPUART0DIV_Msk) >> CLK_LPUARTDIV_LPUART0DIV_Pos;

    }

    if(u32LpUartClkSrcSel == 0ul)
    {
         au32ClkTbl[0] = CLK_GetPCLK4Freq();
    }


    /* Get LPUART baud rate divider */
    u32Baud_Div = (lpuart->BAUD & LPUART_BAUD_BRD_Msk) >> LPUART_BAUD_BRD_Pos;

    /* Calculate UART baud rate if baud rate is set in MODE 0 */
    if ((lpuart->BAUD & (LPUART_BAUD_BAUDM1_Msk | LPUART_BAUD_BAUDM0_Msk)) == LPUART_BAUD_MODE0)
        return ((au32ClkTbl[u32LpUartClkSrcSel]) / (u32LpUartClkDivNum + 1) / (u32Baud_Div + 2)) >> 4;

    /* Calculate UART baud rate if baud rate is set in MODE 2 */
    else if ((lpuart->BAUD & (LPUART_BAUD_BAUDM1_Msk | LPUART_BAUD_BAUDM0_Msk)) == LPUART_BAUD_MODE2)
        return ((au32ClkTbl[u32LpUartClkSrcSel]) / (u32LpUartClkDivNum + 1) / (u32Baud_Div + 2));

    /* Calculate UART baud rate if baud rate is set in MODE 1 */
    else if ((lpuart->BAUD & (LPUART_BAUD_BAUDM1_Msk | LPUART_BAUD_BAUDM0_Msk)) == LPUART_BAUD_BAUDM1_Msk)
        return ((au32ClkTbl[u32LpUartClkSrcSel]) / (u32LpUartClkDivNum + 1) / (u32Baud_Div + 2)) / (((lpuart->BAUD & LPUART_BAUD_EDIVM1_Msk) >> LPUART_BAUD_EDIVM1_Pos) + 1);

    /* Unsupported baud rate setting */
    else
        return 0;
}

const uint32_t au32LpUartBRSel[11] =
{
    2400,
    4800,
    9600,
    14400,
    19200,
    38400,
    57600,
    115200,
    230400,
    460800,
    921600
};

const uint32_t au32LpUartClkSel[4] =
{
    0x0, //LPUARTSEL_PCLK4,
    0x1, //LPUARTSEL_LXT,
    0x2, //LPUARTSEL_MIRC,
    0x3, //UARTSEL_HIRC,
};


void TestFunc_LPUART_Open()
{

    uint8_t  u8LpUartChIdx;    //UART channel index
    uint8_t  u8LpUartBRIdx;    //baud rate index
    uint8_t  u8LpUartClkIdx;   //clock source index
    uint8_t  u8LpUartDivIdx;   //clock divider index
    uint32_t u32ClkTbl[4] = {0,__LXT, __MIRC, __HIRC};
    uint32_t i;

    u32ClkTbl[0] =CLK_GetPCLK4Freq();
    //wait UART send message finish before change clock
    LPUART_WAIT_TX_EMPTY(LPUART0) {};

    /* Test loop */
    //select LPUART cahnnel
//    for (u8LpUartChIdx = 0; u8LpUartChIdx < LPUART_CH_NUM_MAX; u8LpUartChIdx++)
    {

        //select LPUART baud rate
        for (u8LpUartBRIdx = 0; u8LpUartBRIdx < 11; u8LpUartBRIdx++)
        {
            //select LPUART clock source
            for (u8LpUartClkIdx = 0; u8LpUartClkIdx < 4; u8LpUartClkIdx++)
            {
                //skip reserved clock source case
                if (u8LpUartClkIdx == 1 || u8LpUartClkIdx == 2 ) continue;

                //select LPUART clock divider
                for (u8LpUartDivIdx = 0; u8LpUartDivIdx < 16; u8LpUartDivIdx++)
                {
                    //skip BRD smaller than 3 case, BRD will be 3 if set BRD smaller than 3 in mode 2
                    if (u32ClkTbl[u8LpUartClkIdx] < (5 * (au32LpUartBRSel[u8LpUartBRIdx]) * (u8LpUartDivIdx + 1))) continue;

                    //select LPUART clock source and divider
                    if (au32LpUartClkSel[u8LpUartClkIdx] == 2)
                    {
                        if (u8LpUartDivIdx == 0) continue;
                    }

                    SetLPUARTClockSource(LPUART0, au32LpUartClkSel[u8LpUartClkIdx], u8LpUartDivIdx);

//                    for (i = 0; i < 1000; i++) __NOP();
                    for (i = 0; i < 100; i++) __NOP();
										
                    //test function
                    LPUART_Open(LPUART0, au32LpUartBRSel[u8LpUartBRIdx]);
                    //check
                    CU_ASSERT(LPUART0->FUNCSEL == LPUART_FUNCSEL_LPUART);
                    CU_ASSERT(LPUART0->LINE == (LPUART_WORD_LEN_8 | LPUART_PARITY_NONE | LPUART_STOP_BIT_1));
                    CU_ASSERT((LPUART0->FIFO & (LPUART_FIFO_RFITL_Msk | LPUART_BAUD_EDIVM1_Msk)) == 0);
                    CU_ASSERT(GetLpUartBaudrate(LPUART0) > (((au32LpUartBRSel[u8LpUartBRIdx]) * 90) / 100) &&
                              GetLpUartBaudrate(LPUART0) < (((au32LpUartBRSel[u8LpUartBRIdx]) * 110) / 100));


