wosayttn/M55M1BSP/_CUnit/lpuart/lpuart_cunit.c
                }
            }
        }

    }


}

const uint32_t au32LpUartWordSel[4] =
{
    LPUART_WORD_LEN_5,
    LPUART_WORD_LEN_6,
    LPUART_WORD_LEN_7,
    LPUART_WORD_LEN_8,
};

const uint32_t au32LpUartParitySel[5] =
{
    LPUART_PARITY_NONE,
    LPUART_PARITY_ODD,
    LPUART_PARITY_EVEN,
    LPUART_PARITY_MARK,
    LPUART_PARITY_SPACE,
};

const uint32_t au32LpUartStopSel[3] =
{
    LPUART_STOP_BIT_1,
    LPUART_STOP_BIT_1_5,
    LPUART_STOP_BIT_2,
};

void TestFunc_LPUART_SetLine_Config()
{
    //variable for baud rate
    uint8_t u8LpUartChIdx;    //channel index
    uint8_t u8LpUartBRIdx;    //baud rate index
    uint8_t u8LpUartClkIdx;   //clock source index
    uint8_t u8LpUartDivIdx;   //clock divider index
    uint32_t u32ClkTbl[4] = {0,__LXT, __MIRC, __HIRC};

    //variable for data format
    uint8_t u8LpUartWordIdx;      //word length index
    uint8_t u8LpUartParityIdx;    //parity index
    uint8_t u8LpUartStopIdx;      //stop bit length index

    //wait LPUART send message finish before change clock
    LPUART_WAIT_TX_EMPTY(LPUART0) {};

    /* Test loop */
    //select UART channel
//    for (u8LpUartChIdx = 0; u8LpUartChIdx < LPUART_CH_NUM_MAX; u8LpUartChIdx++)
    {
        //select UART baud rate
        for (u8LpUartBRIdx = 0; u8LpUartBRIdx < 11; u8LpUartBRIdx++)
        {
            //select UART clock source
            for (u8LpUartClkIdx = 0; u8LpUartClkIdx < 4; u8LpUartClkIdx++)
            {
                //skip reserved clock source case
                if (u8LpUartClkIdx == 1 || u8LpUartClkIdx == 2 ) continue;

                //select UART clock divider
                for (u8LpUartDivIdx = 0; u8LpUartDivIdx < 16; u8LpUartDivIdx++)
                {
                    //skip BRD smaller than 3 case, BRD will be 3 if set BRD smaller than 3 in mode 2
                    if (u32ClkTbl[u8LpUartClkIdx] < (5 * (au32LpUartBRSel[u8LpUartBRIdx]) * (u8LpUartDivIdx + 1))) continue;

                    //select UART word length
                    for (u8LpUartWordIdx = 0; u8LpUartWordIdx < 4; u8LpUartWordIdx++)
                    {
                        //select UART parity
                        for (u8LpUartParityIdx = 0; u8LpUartParityIdx < 5; u8LpUartParityIdx++)
                        {
                            //select UART stop bit length
                            for (u8LpUartStopIdx = 0; u8LpUartStopIdx < 3; u8LpUartStopIdx++)
                            {
                                //select UART clock source and divider
                                if (au32LpUartClkSel[u8LpUartClkIdx] == 2)
                                {
                                    if (u8LpUartDivIdx == 0) continue;
                                }

                                SetLPUARTClockSource(LPUART0, au32LpUartClkSel[u8LpUartClkIdx], u8LpUartDivIdx);

                                //test function
                                LPUART_SetLineConfig(LPUART0,                                 //select LPUART channel
                                                    au32LpUartBRSel[u8LpUartBRIdx],           //select LPUART baud rate
                                                    au32LpUartWordSel[u8LpUartWordIdx],       //select LPUART word length
                                                    au32LpUartParitySel[u8LpUartParityIdx],   //select LPUART parity
                                                    au32LpUartStopSel[u8LpUartStopIdx]);      //select LPUART stop bit length
                                //check
                                CU_ASSERT(LPUART0->LINE == (au32LpUartWordSel[u8LpUartWordIdx] | au32LpUartParitySel[u8LpUartParityIdx] | au32LpUartStopSel[u8LpUartStopIdx]));
                                CU_ASSERT(GetLpUartBaudrate(LPUART0) > (((au32LpUartBRSel[u8LpUartBRIdx]) * 90) / 100) &&
                                          GetLpUartBaudrate(LPUART0) < (((au32LpUartBRSel[u8LpUartBRIdx]) * 110) / 100));

                            } //u8LpUartStopIdx
                        } //u8LpUartParityIdx
                    } //u8LpUartWordIdx
                } //u8LpUartDivIdx
            } //u8LpUartClkIdx
        } //u8LpUartBRIdx
    } //u8LpUartChIdx


    //restore UART setting for other test
//    for (u8LpUartChIdx = 0; u8LpUartChIdx < LPUART_CH_NUM_MAX; u8LpUartChIdx++)
//    {
        LPUART0->LINE = (LPUART_WORD_LEN_8 | LPUART_PARITY_NONE | LPUART_STOP_BIT_1);
        LPUART0->BAUD = LPUART_BAUD_MODE2 | LPUART_BAUD_MODE2_DIVIDER(__HIRC, 115200);
//    }
}

void TestFunc_LPUART_SetTimeoutCnt()
{
    uint8_t u8LpUartChIdx;        //channel index
    uint16_t u16UartToutCnt;    //time out counter

    /* Test loop */
//    for (u8LpUartChIdx = 0; u8LpUartChIdx < LPUART_CH_NUM_MAX ; u8LpUartChIdx++)
    {
        for (u16UartToutCnt = 0; u16UartToutCnt < 256; u16UartToutCnt++)
        {
            LPUART_SetTimeoutCnt(LPUART0, u16UartToutCnt);
            CU_ASSERT((LPUART0->INTEN & LPUART_INTEN_TOCNTEN_Msk) == LPUART_INTEN_TOCNTEN_Msk);
            CU_ASSERT((LPUART0->TOUT & LPUART_TOUT_TOIC_Msk) == (u16UartToutCnt << LPUART_TOUT_TOIC_Pos));
        
				
						LPUART_BUS_IDLE_TIMEOUT_ENABLE(LPUART0);
            LPUART_SetTimeoutCnt(LPUART0, u16UartToutCnt);
					  CU_ASSERT((LPUART0->TOUT & LPUART_TOUT_BITOMEN_Msk) == 0x80000000);
            CU_ASSERT((LPUART0->INTEN & LPUART_INTEN_TOCNTEN_Msk) == LPUART_INTEN_TOCNTEN_Msk);
            CU_ASSERT((LPUART0->TOUT & LPUART_TOUT_TOIC_Msk) == (u16UartToutCnt << LPUART_TOUT_TOIC_Pos));
					  LPUART_BUS_IDLE_TIMEOUT_DISABLE(LPUART0);
					  CU_ASSERT((LPUART0->TOUT & LPUART_TOUT_BITOMEN_Msk) == 0x0);
            CU_ASSERT((LPUART0->INTEN & LPUART_INTEN_TOCNTEN_Msk) == LPUART_INTEN_TOCNTEN_Msk);
            CU_ASSERT((LPUART0->TOUT & LPUART_TOUT_TOIC_Msk) == (u16UartToutCnt << UART_TOUT_TOIC_Pos));
				
				
				}
    }
}


void TestFunc_LPUART_SelectRS485Mode()
{
    uint8_t u8LpUartChIdx;        //UART channel index
    uint8_t u8RS485ModeIdx;       //RS485 mode
    uint16_t u16RS485AddrIdx;     //RS485 address

