wosayttn/M55M1BSP/_CUnit/lpuart/lpuart_cunit.c
    /* Test loop */
 //   for (u8LpUartChIdx = 0; u8LpUartChIdx < LPUART_CH_NUM_MAX; u8LpUartChIdx++)
    {
        for (u8RS485ModeIdx = 0; u8RS485ModeIdx < 8; u8RS485ModeIdx++)
        {
            //skip AAD and NMM set at the same time case
            if (u8RS485ModeIdx == 3 || u8RS485ModeIdx == 7) continue;

            for (u16RS485AddrIdx = 0; u16RS485AddrIdx < 256; u16RS485AddrIdx++)
            {
                LPUART_SelectRS485Mode(LPUART0, (u8RS485ModeIdx << LPUART_ALTCTL_RS485NMM_Pos), u16RS485AddrIdx);
                CU_ASSERT(LPUART0->FUNCSEL == LPUART_FUNCSEL_RS485);
                CU_ASSERT((LPUART0->ALTCTL & (LPUART_ALTCTL_RS485NMM_Msk | LPUART_ALTCTL_RS485AAD_Msk | LPUART_ALTCTL_RS485AUD_Msk))
                          == (u8RS485ModeIdx << LPUART_ALTCTL_RS485NMM_Pos));
                CU_ASSERT((LPUART0->ALTCTL & LPUART_ALTCTL_ADDRMV_Msk) == (u16RS485AddrIdx << LPUART_ALTCTL_ADDRMV_Pos));
            }
        }
    }

    //restore UART setting for other test
//    for (u8LpUartChIdx = 0; u8LpUartChIdx < LPUART_CH_NUM_MAX; u8LpUartChIdx++)
    {
        LPUART0->LINE = (LPUART_WORD_LEN_8 | LPUART_PARITY_NONE | LPUART_STOP_BIT_1);
        LPUART0->BAUD = LPUART_BAUD_MODE2 | LPUART_BAUD_MODE2_DIVIDER(__HIRC, 115200);
        LPUART0->FUNCSEL = LPUART_FUNCSEL_LPUART;
        LPUART0->ALTCTL &= ~(LPUART_ALTCTL_RS485NMM_Msk | LPUART_ALTCTL_RS485AAD_Msk | LPUART_ALTCTL_RS485AUD_Msk);
    }
}


void TestFunc_LPUART_TestMacroBR()
{
    uint8_t u8LpUartChIdx;    //UART channel index
    uint8_t u8LpUartBRIdx;    //baud rate index
    uint8_t u8LpUartClkIdx;   //clock source index
    uint8_t u8LpUartDivIdx;   //clock divider index
    uint32_t u32ClkTbl[4] = {0,__LXT, __MIRC, __HIRC};
    uint32_t i;

    /* Get HIRC frequency */
    //    u32ClkTbl[1] = __HIRC;
    //wait UART send message finish before change clock
    LPUART_WAIT_TX_EMPTY(LPUART0) {};

    /* Test macro: UART_BAUD_MODE0_DIVIDER */
    //select UART channel
//    for (u8LpUartChIdx = 0; u8LpUartChIdx < LPUART_CH_NUM_MAX; u8LpUartChIdx++)
    {
        //select UART baud rate
        for (u8LpUartBRIdx = 0; u8LpUartBRIdx < 11; u8LpUartBRIdx++)
        {
            //select UART clock source
            for (u8LpUartClkIdx = 0; u8LpUartClkIdx < 4; u8LpUartClkIdx++)
            {
                //skip reserved clock source case
                if (u8LpUartClkIdx == 1 || u8LpUartClkIdx == 2 ) continue;

                //select UART clock divider
                for (u8LpUartDivIdx = 0; u8LpUartDivIdx < 16; u8LpUartDivIdx++)
                {
                    //skip BRD smaller than 0 case in mode 0
                    if (u32ClkTbl[u8LpUartClkIdx] < (5 * (au32LpUartBRSel[u8LpUartBRIdx]) * (u8LpUartDivIdx + 1)) << 4) continue;

                    //select UART clock source and divider
                    if (au32LpUartClkSel[u8LpUartClkIdx] == 2)
                    {
                        if (u8LpUartDivIdx == 0) continue;
                    }

                    SetLPUARTClockSource(LPUART0, au32LpUartClkSel[u8LpUartClkIdx], u8LpUartDivIdx);

                    /* Test macro: UART_BAUD_MODE0_DIVIDER */
                    LPUART0->BAUD = LPUART_BAUD_MODE0 | LPUART_BAUD_MODE0_DIVIDER(((u32ClkTbl[u8LpUartClkIdx]) / (u8LpUartDivIdx + 1)), au32LpUartBRSel[u8LpUartBRIdx]);

//                    for (i = 0; i < 10000; i++) __NOP();
                    for (i = 0; i < 100; i++) __NOP();
                    CU_ASSERT(GetLpUartBaudrate(LPUART0) > (((au32LpUartBRSel[u8LpUartBRIdx]) * 90) / 100) &&
                              GetLpUartBaudrate(LPUART0) < (((au32LpUartBRSel[u8LpUartBRIdx]) * 110) / 100));

                } //u8LpUartDivIdx
            } //u8LpUartClkIdx
        } //u8LpUartBRIdx
    } //u8LpLpUartChIdx

    /* Test macro: UART_BAUD_MODE2_DIVIDER */
    //select UART channel
//    for (u8LpUartChIdx = 0; u8LpUartChIdx < LPUART_CH_NUM_MAX; u8LpUartChIdx++)
    {
        //select UART baud rate
        for (u8LpUartBRIdx = 0; u8LpUartBRIdx < 11; u8LpUartBRIdx++)
        {
            //select UART clock source
            for (u8LpUartClkIdx = 0; u8LpUartClkIdx < 4; u8LpUartClkIdx++)
            {
                //skip reserved clock source case
                if (u8LpUartClkIdx == 1 || u8LpUartClkIdx == 2 ) continue;

                //select UART clock divider
                for (u8LpUartDivIdx = 0; u8LpUartDivIdx < 16; u8LpUartDivIdx++)
                {
                    //skip BRD smaller than 3 case, BRD will be 3 if set BRD smaller than 3 in mode 2
                    if (u32ClkTbl[u8LpUartClkIdx] < (5 * (au32LpUartBRSel[u8LpUartBRIdx]) * (u8LpUartDivIdx + 1))) continue;

                    //select UART clock source and divider
                    if (au32LpUartClkSel[u8LpUartClkIdx] == 1)
                    {
                        if (u8LpUartDivIdx == 0) continue;
                    }

                    SetLPUARTClockSource(LPUART0, au32LpUartClkSel[u8LpUartClkIdx], u8LpUartDivIdx);

                    //test function
                    LPUART0->BAUD = LPUART_BAUD_MODE2 | LPUART_BAUD_MODE2_DIVIDER(((u32ClkTbl[u8LpUartClkIdx]) / (u8LpUartDivIdx + 1)), au32LpUartBRSel[u8LpUartBRIdx]);

//                    for (i = 0; i < 10000; i++) __NOP();
                    for (i = 0; i < 100; i++) __NOP();
                    CU_ASSERT(GetLpUartBaudrate(LPUART0) > (((au32LpUartBRSel[u8LpUartBRIdx]) * 90) / 100) &&
                              GetLpUartBaudrate(LPUART0) < (((au32LpUartBRSel[u8LpUartBRIdx]) * 110) / 100));

                } //u8LpUartDivIdx
            } //u8LpUartClkIdx
        } //u8LpUartBRIdx
    } //u8LpLpUartChIdx

    //restore UART debug port setting for printf
    CLK->LPUARTSEL |= CLK_LPUARTSEL_LPUART0SEL_Msk;
    CLK->UARTDIV0 &= (~CLK_LPUARTDIV_LPUART0DIV_Msk);

    //restore UART setting for other test
//    for (u8LpUartChIdx = 1; u8LpUartChIdx < LPUART_CH_NUM_MAX; u8LpUartChIdx++)
    {
        LPUART0->LINE = (LPUART_WORD_LEN_8 | LPUART_PARITY_NONE | LPUART_STOP_BIT_1);
        LPUART0->BAUD = LPUART_BAUD_MODE2 | LPUART_BAUD_MODE2_DIVIDER(__HIRC, 115200);
    }
}

void TestFunc_LPUART_TestMacroFIFO()
{
    uint8_t u8LpUartChIdx;    //UART channel index
    uint8_t i;  //number control

    //wait UART send message finish
    UART_WAIT_TX_EMPTY(DEBUG_PORT) {};

    /* Set UART1 internal loopback mode */
//    for (u8LpUartChIdx = 0; u8LpUartChIdx < LPUART_CH_NUM_MAX; u8LpUartChIdx++)
    {
        LPUART0->FIFO |= LPUART_FIFO_RXRST_Msk;

        while ((LPUART0->FIFO & LPUART_FIFO_RXRST_Msk) == LPUART_FIFO_RXRST_Msk);

        LPUART0->MODEM |= 0x10;
        LPUART0->LINE = (LPUART_WORD_LEN_8 | LPUART_PARITY_NONE | LPUART_STOP_BIT_1);
        LPUART0->BAUD = LPUART_BAUD_MODE2 | LPUART_BAUD_MODE2_DIVIDER(__HIRC, 115200);
    }

