wosayttn/M55M1BSP/_CUnit/lpuart/lpuart_cunit.c
    /* Test macro : UART_WRITE
                    UART_READ
                    UART_GET_TX_EMPTY
                    UART_GET_RX_EMPTY
                    UART_IS_TX_EMPTY
                    UART_WAIT_TX_EMPTY
                    UART_IS_RX_READY
                    UART_IS_TX_FULL
                    UART_IS_RX_FULL
                    UART_GET_TX_FULL
                    UART_GET_RX_FULL */
    for (u8LpUartChIdx = 0; u8LpUartChIdx < LPUART_CH_NUM_MAX; u8LpUartChIdx++)
    {
        //check initial state
        CU_ASSERT(LPUART_GET_TX_EMPTY(LPUART0) == LPUART_FIFOSTS_TXEMPTY_Msk);
        CU_ASSERT(LPUART_GET_RX_EMPTY(LPUART0) == LPUART_FIFOSTS_RXEMPTY_Msk);
        CU_ASSERT(LPUART_IS_TX_EMPTY(LPUART0) == 1);
        LPUART_WAIT_TX_EMPTY(LPUART0) {};
        CU_ASSERT(LPUART_IS_RX_READY(LPUART0) == 0);
        CU_ASSERT(LPUART_IS_TX_FULL(LPUART0) == 0);
        CU_ASSERT(LPUART_IS_RX_FULL(LPUART0) == 0);
        CU_ASSERT(LPUART_GET_TX_FULL(LPUART0) == 0);
        CU_ASSERT(LPUART_GET_RX_FULL(LPUART0) == 0);

        //check Tx full state
        //set CTS low level active
        LPUART0->MODEMSTS |= LPUART_MODEMSTS_CTSACTLV_Msk;
        //enable CTS auto flow control
        LPUART0->INTEN |= LPUART_INTEN_ATOCTSEN_Msk;
        //send data to let Tx full
        for (i = 0; i < 16; i++)
        {
          LPUART_WRITE(LPUART0, (0x55 + i));
        }
        //check macro
        CU_ASSERT(LPUART_GET_TX_EMPTY(LPUART0) == 0);
        CU_ASSERT(LPUART_GET_RX_EMPTY(LPUART0) == LPUART_FIFOSTS_RXEMPTY_Msk);
        CU_ASSERT(LPUART_IS_TX_EMPTY(LPUART0) == 0);
        CU_ASSERT(LPUART_IS_RX_READY(LPUART0) == 0);
        CU_ASSERT(LPUART_IS_TX_FULL(LPUART0) == 1);
        CU_ASSERT(LPUART_IS_RX_FULL(LPUART0) == 0);
        CU_ASSERT(LPUART_GET_TX_FULL(LPUART0) == LPUART_FIFOSTS_TXFULL_Msk);
        CU_ASSERT(LPUART_GET_RX_FULL(LPUART0) == 0);

        //check Rx full state
        //set CTS high level active
        LPUART0->MODEMSTS &= ~LPUART_MODEMSTS_CTSACTLV_Msk;
        //wait Tx send finished
        LPUART_WAIT_TX_EMPTY(LPUART0) {};
        //check macro
        CU_ASSERT(LPUART_GET_TX_EMPTY(LPUART0) == LPUART_FIFOSTS_TXEMPTY_Msk);
        CU_ASSERT(LPUART_GET_RX_EMPTY(LPUART0) == 0);
        CU_ASSERT(LPUART_IS_TX_EMPTY(LPUART0) == 1);
        CU_ASSERT(LPUART_IS_RX_READY(LPUART0) == 1);
        CU_ASSERT(LPUART_IS_TX_FULL(LPUART0) == 0);
        CU_ASSERT(LPUART_IS_RX_FULL(LPUART0) == 1);
        CU_ASSERT(LPUART_GET_TX_FULL(LPUART0) == 0);
        CU_ASSERT(LPUART_GET_RX_FULL(LPUART0) == LPUART_FIFOSTS_RXFULL_Msk); 
        //read Rx empty
        for (i = 0; i < 16; i++)
        {
          LPUART_READ(LPUART0);
        }
        //check macro
        CU_ASSERT(LPUART_GET_TX_EMPTY(LPUART0) == LPUART_FIFOSTS_TXEMPTY_Msk);
        CU_ASSERT(LPUART_GET_RX_EMPTY(LPUART0) == LPUART_FIFOSTS_RXEMPTY_Msk);
        CU_ASSERT(LPUART_IS_TX_EMPTY(LPUART0) == 1);
        LPUART_WAIT_TX_EMPTY(LPUART0) {};
        CU_ASSERT(LPUART_IS_RX_READY(LPUART0) == 0);
        CU_ASSERT(LPUART_IS_TX_FULL(LPUART0) == 0);
        CU_ASSERT(LPUART_IS_RX_FULL(LPUART0) == 0);
        CU_ASSERT(LPUART_GET_TX_FULL(LPUART0) == 0);
        CU_ASSERT(LPUART_GET_RX_FULL(LPUART0) == 0);
    }

//    for (u8LpUartChIdx = 0; u8LpUartChIdx < LPUART_CH_NUM_MAX; u8LpUartChIdx++)
    {
        //disable CTS auto flow control after test
        LPUART0->INTEN &= ~LPUART_INTEN_ATOCTSEN_Msk;
        //disable UART1 internal loopback mode after test */
        LPUART0->MODEM &= ~0x10;
    }
}

void TestFunc_LPUART_TestMacroRTS()
{
    uint8_t u8LpUartChIdx;    //UART channel index
    uint32_t i;

//    for (u8LpUartChIdx = 0; u8LpUartChIdx < LPUART_CH_NUM_MAX; u8LpUartChIdx++)
    {

        /* Test macro : LPUART_CLEAR_RTS
                        LPUART_SET_RTS */
        //disable RTS auto flow control
        LPUART0->INTEN &= ~LPUART_INTEN_ATORTSEN_Msk;
        LPUART_SET_RTS(LPUART0);

        while (!(LPUART0->MODEM & LPUART_MODEM_RTSSTS_Msk)) {};

//        for (i = 0; i < 1000000; i++) {};
				for (i = 0; i < 100; i++) {};

        CU_ASSERT((LPUART0->MODEM & (LPUART_MODEM_RTSSTS_Msk | LPUART_MODEM_RTSACTLV_Msk | LPUART_MODEM_RTS_Msk)) == (LPUART_MODEM_RTSSTS_Msk | LPUART_MODEM_RTSACTLV_Msk | LPUART_MODEM_RTS_Msk));

        LPUART_CLEAR_RTS(LPUART0);

        while ((LPUART0->MODEM & LPUART_MODEM_RTSSTS_Msk)) {};

        CU_ASSERT((LPUART0->MODEM & (LPUART_MODEM_RTSSTS_Msk | LPUART_MODEM_RTSACTLV_Msk | LPUART_MODEM_RTS_Msk)) == LPUART_MODEM_RTSACTLV_Msk);

				LPUART_RS485RTSDLY_SET(LPUART0,0x5555);
				CU_ASSERT((LPUART0->RS485DD & LPUART_RS485DD_RTSDDLY_Msk ) == 0x5555);	
				LPUART_RS485RTSDLY_SET(LPUART0,0xaaaa);
				CU_ASSERT((LPUART0->RS485DD & LPUART_RS485DD_RTSDDLY_Msk ) == 0xaaaa);
			  LPUART_RS485RTSDLY_SET(LPUART0,0);
				CU_ASSERT((LPUART0->RS485DD & LPUART_RS485DD_RTSDDLY_Msk ) == 0);	
			  LPUART_DEGLITCH_ENABLE(LPUART0);
				CU_ASSERT((LPUART0->FUNCSEL & LPUART_FUNCSEL_DGE_Msk ) == 0x40);
		    LPUART_DEGLITCH_DISABLE(LPUART0);
				CU_ASSERT((LPUART0->FUNCSEL & LPUART_FUNCSEL_DGE_Msk ) == 0x0);					
			  LPUART_TXRX_SWAP_ENABLE(LPUART0);
				CU_ASSERT((LPUART0->FUNCSEL & LPUART_FUNCSEL_TXRXSWP_Msk ) == 0x80);
		    LPUART_TXRX_SWAP_DISABLE(LPUART0);
				CU_ASSERT((LPUART0->FUNCSEL & LPUART_FUNCSEL_TXRXSWP_Msk ) == 0x0);			
					
    }
}

void TestFunc_LPUART_TestMacroINT()
{
    uint8_t u8LpUartChIdx;    //UART channel index
    uint8_t u8UartINTEnIdx; //bit
    uint32_t i;

    //wait UART send message finish
    UART_WAIT_TX_EMPTY(DEBUG_PORT) {};

    for (u8LpUartChIdx = 0; u8LpUartChIdx < LPUART_CH_NUM_MAX; u8LpUartChIdx++)
    {
        for (u8UartINTEnIdx = 0; u8UartINTEnIdx < 10; u8UartINTEnIdx++)
        {
            /* Test macro : LPUART_ENABLE_INT
                            LPUART_DISABLE_INT */
            //Enable bit in IER register
            //0 : Receive data available interrupt
            //1 : Transmit holding register empty interrupt
            //2 : Receive line status interrupt
            //3 : Modem status interrupt
            //4 : Rx time-out interrupt
            //5 : Buffer error interrupt
            //6 : LIN bus interrupt
            //7 : CTS wake-up interrupt
            //8 : Data Wake-up interrupt
            //9 : Auto baud-rate interrupt
            //10: Tx end interrupt
            //11: Single-wire Bit Error Detection Interrupt

            LPUART_ENABLE_INT(LPUART0, au32LpUartINTEnSel[u8UartINTEnIdx]);
            CU_ASSERT((LPUART0->INTEN & au32LpUartINTEnSel[u8UartINTEnIdx]) == au32LpUartINTEnSel[u8UartINTEnIdx]);
            LPUART_DISABLE_INT(LPUART0, au32LpUartINTEnSel[u8UartINTEnIdx]);
            CU_ASSERT((LPUART0->INTEN & au32LpUartINTEnSel[u8UartINTEnIdx]) == 0);
        }
    }

