wosayttn/M55M1BSP/_CUnit/lpuart/lpuart_cunit.c
    for (u8LpUartChIdx = 0; u8LpUartChIdx < LPUART_CH_NUM_MAX; u8LpUartChIdx++)
    {
        /* Test macro : LPUART_GET_INT_FLAG */

        //enable UART1 internal loopback
        LPUART0->MODEM |= 0x10;

        //RX FIFO reset
        LPUART0->FIFO |= LPUART_FIFO_RXRST_Msk;

        while ((LPUART0->FIFO & LPUART_FIFO_RXRST_Msk) == LPUART_FIFO_RXRST_Msk);

        //0 : Receive data available interrupt
        //1 : Transmit holding register empty interrupt
        // set CTS low level active
        LPUART0->MODEMSTS |= LPUART_MODEMSTS_CTSACTLV_Msk;
        // enable CTS auto flow control
        LPUART0->INTEN |= LPUART_INTEN_ATOCTSEN_Msk;
        // check macro
        CU_ASSERT(LPUART_GET_INT_FLAG(LPUART0, LPUART_INTSTS_THREIF_Msk) == 1);
        // fill Tx
        LPUART_WRITE(LPUART0, 0x55);
        // check macro
        CU_ASSERT(LPUART_GET_INT_FLAG(LPUART0, LPUART_INTSTS_THREIF_Msk) == 0);
        CU_ASSERT(LPUART_GET_INT_FLAG(LPUART0, LPUART_INTSTS_RDAIF_Msk) == 0);
        // set CTS high level active to release data in Tx FIFO
        LPUART0->MODEMSTS &= ~LPUART_MODEMSTS_CTSACTLV_Msk;

        //LPUART0->MODEMSTS |= LPUART_MODEMSTS_CTSACTLV_Msk;
        // wait data send out
        while ((LPUART0->FIFOSTS & LPUART_FIFOSTS_TXEMPTYF_Msk) == 0) {};

        // check macro
        CU_ASSERT(LPUART_GET_INT_FLAG(LPUART0, LPUART_INTSTS_THREIF_Msk) == 1);

        // wait data receive
        while ((LPUART0->FIFOSTS & LPUART_FIFOSTS_RXEMPTY_Msk) == LPUART_FIFOSTS_RXEMPTY_Msk) {};

        // check macro
        CU_ASSERT(LPUART_GET_INT_FLAG(LPUART0, LPUART_INTSTS_RDAIF_Msk) == 1);

        // read Rx
        LPUART_READ(LPUART0);

        // check macro
        CU_ASSERT(LPUART_GET_INT_FLAG(LPUART0, LPUART_INTSTS_RDAIF_Msk) == 0);

        // disable CTS auto flow control after test
        LPUART0->INTEN &= ~LPUART_INTEN_ATOCTSEN_Msk;

        //2 : Receive line status interrupt
        // check macro
        CU_ASSERT(LPUART_GET_INT_FLAG(LPUART0, LPUART_INTSTS_RLSIF_Msk) == 0);

        // send break
        LPUART0->LINE |= LPUART_LINE_BCB_Msk;

        // wait break error happen
        while ((LPUART0->FIFOSTS & LPUART_FIFOSTS_BIF_Msk) == 0) {};

        // check macro
        CU_ASSERT(LPUART_GET_INT_FLAG(LPUART0, LPUART_INTSTS_RLSIF_Msk) == 1);

        // stop send break
        LPUART0->LINE &= ~LPUART_LINE_BCB_Msk;

        // clear receive line status flag
        LPUART_ClearIntFlag(LPUART0, LPUART_INTSTS_RLSINT_Msk);

        // check macro
        CU_ASSERT(LPUART_GET_INT_FLAG(LPUART0, LPUART_INTSTS_RLSIF_Msk) == 0);

        // clear Rx FIFO
        LPUART0->FIFO |= LPUART_FIFO_RXRST_Msk;

        while ((LPUART0->FIFO & LPUART_FIFO_RXRST_Msk) == LPUART_FIFO_RXRST_Msk) {};

        //3 : Modem status interrupt
        // check macro
        CU_ASSERT(LPUART_GET_INT_FLAG(LPUART0, LPUART_INTSTS_MODEMIF_Msk) == 1);

        // clear CTS flag

        LPUART0->MODEMSTS |= LPUART_MODEMSTS_CTSDETF_Msk;

//        for (i = 0; i < 10000; i++) __NOP();
        for (i = 0; i < 100; i++) __NOP();
					
        LPUART0->MODEMSTS |= LPUART_MODEMSTS_CTSDETF_Msk;

        // check macro
        CU_ASSERT(LPUART_GET_INT_FLAG(LPUART0, LPUART_INTSTS_MODEMIF_Msk) == 0);

        //4 : Rx time-out interrupt
        // check macro
        CU_ASSERT(LPUART_GET_INT_FLAG(LPUART0, LPUART_INTSTS_RXTOIF_Msk) == 0);
        // enable time out counter
        LPUART0->INTEN |= LPUART_INTEN_TOCNTEN_Msk;
        // send Tx
        LPUART_WRITE(LPUART0, 0x55);

        // wait Rx time out happen
        while ((LPUART0->INTSTS & LPUART_INTSTS_RXTOIF_Msk) == 0) {};

        // check macro
        CU_ASSERT(LPUART_GET_INT_FLAG(LPUART0, LPUART_INTSTS_RXTOIF_Msk) == 1);

        // disable time out counter after finish test
        LPUART0->INTEN &= ~LPUART_INTEN_TOCNTEN_Msk;

        // read Rx
        LPUART_READ(LPUART0);

        // check macro
        CU_ASSERT(LPUART_GET_INT_FLAG(LPUART0, LPUART_INTSTS_RXTOINT_Msk) == 0);

        //5 : Buffer error interrupt
        // check macro
//      if (u8LpUartChIdx != 4)
            CU_ASSERT(LPUART_GET_INT_FLAG(LPUART0, LPUART_INTSTS_BUFERRIF_Msk) == 0);

        // send data and wait Rx buffer error flag happen
        while ((LPUART0->INTSTS & LPUART_INTSTS_BUFERRIF_Msk) == 0)
        {
            // send Tx
            LPUART_WRITE(LPUART0, 0x55);
        }

        // check macro
        CU_ASSERT(LPUART_GET_INT_FLAG(LPUART0, LPUART_INTSTS_BUFERRIF_Msk) == 1);
        // clear Rx buffer error flag
        LPUART0->FIFOSTS |= LPUART_FIFOSTS_RXOVIF_Msk;

        while ((LPUART0->FIFOSTS & LPUART_FIFOSTS_RXOVIF_Msk) == LPUART_FIFOSTS_RXOVIF_Msk) {};

        // check macro
        CU_ASSERT(LPUART_GET_INT_FLAG(LPUART0, LPUART_INTSTS_BUFERRIF_Msk) == 0);

        // clear Rx FIFO
        LPUART0->FIFO |= LPUART_FIFO_RXRST_Msk;

        while ((LPUART0->FIFOSTS & LPUART_FIFO_RXRST_Msk) == LPUART_FIFO_RXRST_Msk) {};

        /* Test macro : LPUART_RS485_CLEAR_ADDR_FLAG
                        LPUART_RS485_GET_ADDR_FLAG */
        // check macro
        CU_ASSERT(LPUART_RS485_GET_ADDR_FLAG(LPUART0) == 0);

        CU_ASSERT(LPUART_GET_INT_FLAG(LPUART0, LPUART_INTSTS_RLSINT_Msk) == 0);

        // set RS485 mode
        LPUART0->FUNCSEL = LPUART_FUNCSEL_RS485;

        // set RS485 address detection enable
        LPUART0->ALTCTL |= (LPUART_ALTCTL_ADDRDEN_Msk | LPUART_ALTCTL_RS485NMM_Msk);

        // set parity 1
        LPUART0->LINE = LPUART_WORD_LEN_8 | LPUART_PARITY_ODD | LPUART_STOP_BIT_1;

        // send Tx
        LPUART_WRITE(LPUART0, 0x55);

        // wait RS485 address flag happen
        while ((LPUART0->FIFOSTS & LPUART_FIFOSTS_ADDRDETF_Msk) == 0) {};

        // check macro
        CU_ASSERT(LPUART_RS485_GET_ADDR_FLAG(LPUART0) == 1);

        CU_ASSERT(LPUART_GET_INT_FLAG(LPUART0, LPUART_INTSTS_RLSIF_Msk) == 1);

        // clear RS485 address flag
        LPUART_RS485_CLEAR_ADDR_FLAG(LPUART0);

        // check macro
        CU_ASSERT(LPUART_RS485_GET_ADDR_FLAG(LPUART0) == 0);

        CU_ASSERT(LPUART_GET_INT_FLAG(LPUART0, LPUART_INTSTS_RLSIF_Msk) == 0);

