wosayttn/M55M1BSP/_CUnit/lpuart/lpuart_cunit.c
        LPUART0->ALTCTL = 0xC;


        //disable LPUART internal loopback mode after test */
        LPUART0->MODEM &= ~0x10;

        LPUART0->FUNCSEL = LPUART_FUNCSEL_LPUART;

        LPUART0->LINE = LPUART_WORD_LEN_8 | LPUART_PARITY_NONE | LPUART_STOP_BIT_1;

        LPUART0->ALTCTL &= ~(LPUART_ALTCTL_ADDRDEN_Msk | LPUART_ALTCTL_RS485NMM_Msk);
    }

}


const uint32_t au32UartRxTrgSel[4] =
{
    LPUART_FIFO_RFITL_1BYTE,
    LPUART_FIFO_RFITL_4BYTES,
    LPUART_FIFO_RFITL_8BYTES,
    LPUART_FIFO_RFITL_14BYTES,
};

const uint32_t au32UartRTSTrgSel[4] =
{
    LPUART_FIFO_RTSTRGLV_1BYTE,
    LPUART_FIFO_RTSTRGLV_4BYTES,
    LPUART_FIFO_RTSTRGLV_8BYTES,
    LPUART_FIFO_RTSTRGLV_14BYTES,
};

void TestFunc_LPUART_TestConstant()
{
    uint8_t u8LpUartChIdx;        //UART channel index
    uint16_t u16TestIdx;
    uint32_t i;

    //wait UART send message finish
    UART_WAIT_TX_EMPTY(DEBUG_PORT) {};

    // Only uart0/uart1 support LIN mode for TC8237
    // Only uart0 support LIN mode for M252

 //   for (u8LpUartChIdx = 0; u8LpUartChIdx < LPUART_CH_NUM_MAX; u8LpUartChIdx++)
    {
        //select Rx FIFO trigger level
        for (u16TestIdx = 0; u16TestIdx < 4; u16TestIdx++)
        {
            LPUART0->FIFO = ((LPUART0->FIFO & (~LPUART_FIFO_RFITL_Msk)) | au32UartRxTrgSel[u16TestIdx]);

//            if (u8LpUartChIdx != 4)
            {
                CU_ASSERT((LPUART0->FIFO & LPUART_FIFO_RFITL_Msk) == au32UartRxTrgSel[u16TestIdx]);
            }
//            else
//            {
//                CU_ASSERT((LPUART0->FIFO & LPUART_FIFO_RFITL_Msk) == au32UartRxTrgSel[0]);
//            }

        }

        //select RTS trigger level index
        for (u16TestIdx = 0; u16TestIdx < 4; u16TestIdx++)
        {
            LPUART0->FIFO = ((LPUART0->FIFO & (~LPUART_FIFO_RTSTRGLV_Msk)) | au32UartRTSTrgSel[u16TestIdx]);

//            if (u8LpUartChIdx != 4)
            {
                CU_ASSERT((LPUART0->FIFO & LPUART_FIFO_RTSTRGLV_Msk) == au32UartRTSTrgSel[u16TestIdx]);
            }
//            else
//            {
//                CU_ASSERT((LPUART0->FIFO & LPUART_FIFO_RTSTRGLV_Msk) == au32UartRTSTrgSel[0]);
//            }
        }

        //select RTS active level
        LPUART0->MODEM = ((LPUART0->MODEM & (~LPUART_MODEM_RTSACTLV_Msk)) | LPUART_RTS_IS_LOW_LEV_ACTIVE);
        CU_ASSERT((LPUART0->MODEM & LPUART_MODEM_RTSACTLV_Msk) == LPUART_RTS_IS_LOW_LEV_ACTIVE);

        LPUART0->MODEM = ((LPUART0->MODEM & (~LPUART_MODEM_RTSACTLV_Msk)) | LPUART_RTS_IS_HIGH_LEV_ACTIVE);
        CU_ASSERT((LPUART0->MODEM & LPUART_MODEM_RTSACTLV_Msk) == LPUART_RTS_IS_HIGH_LEV_ACTIVE);
    }

    CU_ASSERT(LPUART0_FIFO_SIZE == 16);

    LPUART_IPReset(LPUART0);

}

void TestFunc_LPUART_ReadWrite()
{
    uint8_t u8LpUartChIdx, i;        //UART channel index
    uint8_t u8TxData[8] = {1, 2, 3, 4, 5, 6, 7, 8};
    uint8_t u8RxData[8] = {0};

    /* Test loop */
//    for (u8LpUartChIdx = 0; u8LpUartChIdx < LPUART_CH_NUM_MAX; u8LpUartChIdx++)
    {
        LPUART0->MODEM |= 0x10; // set loop back mode

        /* Configure UART0 and set UART0 baud rate */
        LPUART0->BAUD = LPUART_BAUD_MODE2 | LPUART_BAUD_MODE2_DIVIDER(__HIRC, 115200);
        LPUART0->LINE = LPUART_WORD_LEN_8 | LPUART_PARITY_NONE | LPUART_STOP_BIT_1;

        /* Reset Tx/Rx FIFO */
        LPUART0->FIFO |= 0x6;

        while (LPUART0->FIFO & 0x6){};

//        if (u8LpUartChIdx != 4)
        {
            /* Write data */
            LPUART_Write(LPUART0, u8TxData, 8);
            /* Read data */
            LPUART_Read(LPUART0, u8RxData, 8);

            for (i = 0; i < 8; i++)
            {
                CU_ASSERT(u8TxData[i] == u8RxData[i]);
            }
        }
//        else
//        {
//            /* Write data */
//            LPUART_Write(LPUART0, u8TxData, 1);
//            /* Read data */
//            LPUART_Read(LPUART0, u8RxData, 1);

//            CU_ASSERT(u8TxData[0] == u8RxData[0]);

//        }

    }

}
void TestFunc_LPUART_SetAutoOp()
{
 
  	LPUART_AUTO_OP_ENABLE(LPUART0);
		CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_AOEN_Msk ) == 0x80000000);	
	  LPUART_AUTO_OP_DISABLE(LPUART0);
	  CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_AOEN_Msk ) == 0x0);
    LPUART_AOUT_OP_CLOCK_ALWAYS_ON_ENABLE(LPUART0);
		CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_CKAWOEN_Msk ) == 0x20);	
	  LPUART_AOUT_OP_CLOCK_ALWAYS_ON_DISABLE(LPUART0);
	  CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_CKAWOEN_Msk ) == 0x0);		

    LPUART_BUS_IDLE_TIMEOUT_WAKEUP_ENABLE(LPUART0);
		CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_WKAOTOEN_Msk ) == 0x100);	
	  LPUART_BUS_IDLE_TIMEOUT_WAKEUP_DISABLE(LPUART0);
	  CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_WKAOTOEN_Msk ) == 0x0);	

	  LPUART_SelectAutoOperationMode(LPUART0,LPUART_AUTOCTL_TRIGSEL_SOFTWARE);
	  CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_AOEN_Msk ) == 0x80000000);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_CKAWOEN_Msk ) == 0x20);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_TRIGEN_Msk ) == 0x0);	
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_TRIGSEL_Msk ) == 0x0);	
	  LPUART_AUTO_OP_SW_TRIGGER_ENABLE(LPUART0); 
	  CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_SWTRIG_Msk ) == 0x0);
	
    LPUART_SelectAutoOperationMode(LPUART0,LPUART_AUTOCTL_TRIGSEL_LPTMR0);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_AOEN_Msk ) == 0x80000000);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_CKAWOEN_Msk ) == 0x20);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_TRIGEN_Msk ) == 0x10);	
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_TRIGSEL_Msk ) == 0x0);	

    LPUART_SelectAutoOperationMode(LPUART0,LPUART_AUTOCTL_TRIGSEL_LPTMR1);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_AOEN_Msk ) == 0x80000000);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_CKAWOEN_Msk ) == 0x20);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_TRIGEN_Msk ) == 0x10);	
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_TRIGSEL_Msk ) == 0x1);	

    LPUART_SelectAutoOperationMode(LPUART0,LPUART_AUTOCTL_TRIGSEL_TTMR0);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_AOEN_Msk ) == 0x80000000);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_CKAWOEN_Msk ) == 0x20);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_TRIGEN_Msk ) == 0x10);	
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_TRIGSEL_Msk ) == 0x2);	

    LPUART_SelectAutoOperationMode(LPUART0,LPUART_AUTOCTL_TRIGSEL_TTMR1);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_AOEN_Msk ) == 0x80000000);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_CKAWOEN_Msk ) == 0x20);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_TRIGEN_Msk ) == 0x10);	
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_TRIGSEL_Msk ) == 0x3);

    LPUART_SelectAutoOperationMode(LPUART0,LPUART_AUTOCTL_TRIGSEL_WKIOA0);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_AOEN_Msk ) == 0x80000000);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_CKAWOEN_Msk ) == 0x20);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_TRIGEN_Msk ) == 0x10);	
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_TRIGSEL_Msk ) == 0x4);

    LPUART_SelectAutoOperationMode(LPUART0,LPUART_AUTOCTL_TRIGSEL_WKIOB0);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_AOEN_Msk ) == 0x80000000);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_CKAWOEN_Msk ) == 0x20);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_TRIGEN_Msk ) == 0x10);	
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_TRIGSEL_Msk ) == 0x5);

    LPUART_SelectAutoOperationMode(LPUART0,LPUART_AUTOCTL_TRIGSEL_WKIOC0);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_AOEN_Msk ) == 0x80000000);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_CKAWOEN_Msk ) == 0x20);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_TRIGEN_Msk ) == 0x10);	
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_TRIGSEL_Msk ) == 0x6);

    LPUART_SelectAutoOperationMode(LPUART0,LPUART_AUTOCTL_TRIGSEL_WKIOD0);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_AOEN_Msk ) == 0x80000000);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_CKAWOEN_Msk ) == 0x20);
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_TRIGEN_Msk ) == 0x10);	
    CU_ASSERT((LPUART0->AUTOCTL & LPUART_AUTOCTL_TRIGSEL_Msk ) == 0x7);	
}	

CU_TestInfo LPUART_ApiTests[] =
{
    {"LPUART_Enable/DisableFlowCtrl Function.", TestFunc_LPUART_EnableFlowCtrl},
    {"LPUART_Enable/DisableInt Function.", TestFunc_LPUART_EnableInt},
    {"LPUART_Open Function.", TestFunc_LPUART_Open},
    {"LPUART_SetLine_Config Function.", TestFunc_LPUART_SetLine_Config},
    {"LPUART_SetTimeoutCnt Function.", TestFunc_LPUART_SetTimeoutCnt},
    {"LPUART_SelectRS485Mode Function.", TestFunc_LPUART_SelectRS485Mode},
    {"LPUART_SetAutoOp Function.", TestFunc_LPUART_SetAutoOp},
    {"LPUART_ReadWrite Function.", TestFunc_LPUART_ReadWrite},
    CU_TEST_INFO_NULL
};




CU_TestInfo LPUART_MacroTests[] =
{
    {"Macro about baud rate.", TestFunc_LPUART_TestMacroBR},
    {"Macro about FIFO.", TestFunc_LPUART_TestMacroFIFO},
    {"Macro about RTS.", TestFunc_LPUART_TestMacroRTS},
    {"Macro about interrupt.", TestFunc_LPUART_TestMacroINT},
    {"Constant.", TestFunc_LPUART_TestConstant},

    CU_TEST_INFO_NULL
};

